In [1]:
import sqlite3

In [2]:
db=sqlite3.connect("E:/MySQLite_Database/student_course_database.db")

In [3]:
cur=db.cursor()

constraints------
unique--enter only unique value, no duplicate values
not null--no blank values can be inserted in table

In [4]:
cur.execute("create table course(courseid int primary key, coursename text, duration int)")

In [5]:
cur.execute("create table student(roll_no int primary key, studentname text, age int, courseid int, foreign key(courseid) references course(courseid))")

In [6]:
cur.execute("insert into course values(78, 'Data science', 12),(56, 'Python course' ,4),(101, 'Database', 7)")

print(cur.rowcount,"record(s) inserted")

db.commit()

3 record(s) inserted

In [7]:
cur.execute("insert into student values(1, 'Jack' ,22,78),(2, 'John', 21,56),(3, 'Rudolf', 18,78),(4, 'Jim', 21,56)")

print(cur.rowcount,"record(s) inserted")

db.commit()

4 record(s) inserted

In [8]:
results = cur.execute("select * from course")

results.fetchall()

[(78, 'Data science', 12), (56, 'Python course', 4), (101, 'Database', 7)]

In [9]:
results = cur.execute("select * from student")

results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [10]:
results = cur.execute('select courseid from course where coursename= "Data science"')

for i in results:
    print(i)

(78,)

# Subquery

In [11]:
results = cur.execute('select * from student where courseid=(select courseid from course where coursename="Data science")')

results.fetchall()

[(1, 'Jack', 22, 78), (3, 'Rudolf', 18, 78)]

In [12]:
results = cur.execute('select * from student where courseid=(select courseid from course where coursename="Python course")')

results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

# Join

# Inner Join

In [13]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student INNER JOIN course ON student.courseid = student.courseid"

results = cur.execute(sql) 
results.fetchall()

[(1, 'Jack', 78, 'Data science'),
 (1, 'Jack', 56, 'Python course'),
 (1, 'Jack', 101, 'Database'),
 (2, 'John', 78, 'Data science'),
 (2, 'John', 56, 'Python course'),
 (2, 'John', 101, 'Database'),
 (3, 'Rudolf', 78, 'Data science'),
 (3, 'Rudolf', 56, 'Python course'),
 (3, 'Rudolf', 101, 'Database'),
 (4, 'Jim', 78, 'Data science'),
 (4, 'Jim', 56, 'Python course'),
 (4, 'Jim', 101, 'Database')]

# LEFT Join

In [14]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM student LEFT JOIn course ON student.courseid = student.courseid"
results = cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data science'),
 (1, 'Jack', 56, 'Python course'),
 (1, 'Jack', 101, 'Database'),
 (2, 'John', 78, 'Data science'),
 (2, 'John', 56, 'Python course'),
 (2, 'John', 101, 'Database'),
 (3, 'Rudolf', 78, 'Data science'),
 (3, 'Rudolf', 56, 'Python course'),
 (3, 'Rudolf', 101, 'Database'),
 (4, 'Jim', 78, 'Data science'),
 (4, 'Jim', 56, 'Python course'),
 (4, 'Jim', 101, 'Database')]

In [15]:
sql = "SELECT student.roll_no, student.studentname, course.courseid, course.coursename FROM course LEFT JOIN student on student.courseid = student.courseid"
results = cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data science'),
 (2, 'John', 78, 'Data science'),
 (3, 'Rudolf', 78, 'Data science'),
 (4, 'Jim', 78, 'Data science'),
 (1, 'Jack', 56, 'Python course'),
 (2, 'John', 56, 'Python course'),
 (3, 'Rudolf', 56, 'Python course'),
 (4, 'Jim', 56, 'Python course'),
 (1, 'Jack', 101, 'Database'),
 (2, 'John', 101, 'Database'),
 (3, 'Rudolf', 101, 'Database'),
 (4, 'Jim', 101, 'Database')]

# Right Join And Full Outer Join not supported in SQLite

In [16]:
import sqlite3

Adding date in table

In [17]:
db=sqlite3.connect("E:/MySQLite_Database/sports_database.db")

In [18]:
cur=db.cursor()

constraints------
unique--enter only unique value, no duplicate values
not null--no blank values can be inserted in table

In [19]:
cur.execute("create table sport (id int primary key, sportname text unique, dateofevent date, country text not null)")

OperationalError: table sport already exists

In [20]:
cur.execute("insert into sport values(1, 'cricket', '2021-11-19', 'England')")

#this line will throw error as sportname is duplicate --- unique constraint failed

#cur.execute("insert into sport values(2, 'cricket', '20118-08-02', 'Srilanka')")

In [22]:
cur.execute("insert into sport values(2, 'tennis', '2018-08-02', 'Srilanka')")
print(cur.rowcount, "record(s) inserted")

1 record(s) inserted

In [23]:
results = cur.execute('select * from sport')
results.fetchall()

[(1, 'cricket', '2021-11-19', 'England'),
 (2, 'tennis', '2018-08-02', 'Srilanka')]

# Employee database with DB and Python programmatically

In [1]:
import sqlite3

In [2]:
con=sqlite3.connect("E:/MySQLite_Database/emp_database.db")

In [3]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee (id integer primary key, name text, salary real, department text, position text, hiredate date)")
    con.commit()

In [4]:
#calling function
sql_table(con)

In [5]:
cur=con.cursor()
cur.execute("insert into employee values(1, 'Jack', 9000, 'HR', 'Manager', '2019-07-09')")

In [6]:
con.commit;

In [7]:
results = cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09')]

We can also pass values/ arguements to an INSERT statement in the execute( method. You can use the question mark(?) as a placeholder for each value. The syntax of the INSERT will be like the following.

cur.execute('''insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)''',entities)
entities=(2,'John',4000,'IT','Engineer','2015-04-06')

In [8]:
def sql_insert(con, entities):
    cur=con.cursor()
    cur.execute('insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)',entities)

In [9]:
entities=(2, 'Andrew', 7000, 'IT', 'Engineer', '2015-04-06')

In [10]:
#calling sql insert to insert the data

sql_insert(con, entities)

In [11]:
entities=(3, 'Thomas', 6000, 'HR', 'Manager', '2016-06-14')

In [12]:
sql_insert(con,entities)

In [13]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [14]:
entities=(4, 'Rudolf', 8000, 'IT', 'Engineer', '2012-08-23') 

sql_insert(con,entities)

entities=(5, 'Suzen', 10000, 'Sales', 'Sales Executive', '2018-02-19')

sql_insert(con,entities)

In [15]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [16]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="Martin" where id=1')
    con.commit()

In [17]:
sql_update(con)

In [18]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [19]:
results=cur.execute("select id,name from employee")
results.fetchall()

[(1, 'Martin'), (2, 'Andrew'), (3, 'Thomas'), (4, 'Rudolf'), (5, 'Suzen')]

In [20]:
results=cur.execute("select id,name from employee where salary>8000")
results.fetchall()

[(1, 'Martin'), (5, 'Suzen')]

In [21]:
results=cur.execute("select min(salary) from employee")
results.fetchall()

[(6000.0,)]

In [22]:
results=cur.execute("select count(id) from employee")
results.fetchone()

(5,)

In [23]:
results=cur.execute("select distinct(department) from employee")
results.fetchall()

[('HR',), ('IT',), ('Sales',)]

In [24]:
results=cur.execute("select count(distinct(department)) from employee")
results.fetchone()

(3,)

In [25]:
results=cur.execute("select sum(salary), position from employee group by position")
results.fetchall()

[(15000.0, 'Engineer'), (15000.0, 'Manager'), (10000.0, 'Sales Executive')]

In [26]:
results=cur.execute("select sum(salary), department from employee group by position")
results.fetchall()

[(15000.0, 'IT'), (15000.0, 'HR'), (10000.0, 'Sales')]

In [27]:
def sql_query(sql):
     cur=con.cursor()
     results=cur.execute(sql)
     return results

In [28]:
#make query
sql="select * from employee"

#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')]

In [29]:
sql="select id, name, position from employee"

#pass query in function
respond=sql_query(sql)
respond.fetchall()

[(1, 'Martin', 'Manager'),
 (2, 'Andrew', 'Engineer'),
 (3, 'Thomas', 'Manager'),
 (4, 'Rudolf', 'Engineer'),
 (5, 'Suzen', 'Sales Executive')]

# SQLite3 Executemany (Bulk insert)

We can use the executemany statement to insert multiple rows at once.

In [30]:
entities=[(6, 'Joseph', 4000, 'Account', 'CA', '2016-15-05'),(7, 'Maria', 10000, 'Sales','Sales Executive', '2018-05-25' )]

In [31]:
cur.executemany('insert into employee(id,name,salary,department,position,hiredate)values(?,?,?,?,?,?)',entities)

In [32]:
results=cur.execute("select * from employee")

for row in results:
    print(row)

(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09')
(2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06')
(3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')
(4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23')
(5, 'Suzen', 10000.0, 'Sales', 'Sales Executive', '2018-02-19')
(6, 'Joseph', 4000.0, 'Account', 'CA', '2016-15-05')
(7, 'Maria', 10000.0, 'Sales', 'Sales Executive', '2018-05-25')